//
//  Setting.swift
//  Clock
//
//  Created by Алина Власенко on 07.02.2023.
//

import Foundation

//також створюємо енум з кейсами проперті, те що буде по правій стороні таблички зустрічатись
enum SettingsOptions {
    case label //використовується в комірках Повторювати і звук і в таблиці таймера
    case textField //використовується для Назви будильника
    case uiSwitch //використовується в комірці відкласти будильник
}

//створюємо модель для табличок з налаштуваннями, які зустрічаються і в додаванні нового будильника і в таймері. Будемо цю модель використовувати в обох вьюшках.
struct Setting {
    let title: String //Тайтли комірок
    let property: SettingsOptions //налаштування пропетрі для комірок - їх значень з правої сторони таблички - будемо передавати кейси з енуму
    let propertyValue: String //текстове значення для проперті у правій стороні таблички
    let accesorry: Bool //передамо сюди тип комірки типу Disclosure Indicator, Detail Disclosure, Checkmark. В нашому випадку буде Disclosure Indicator.
}
